Used to Replace data when some OBJECT datatype values are in Integer data type COLUMN
And than the datatype also have to be changes to the certain need

In [3]:
import pandas as pd
import numpy as np

In [4]:
data=pd.read_csv("Students.csv")
data.head(3)

,Name,Age,CGPA (out of 4.00),Daily Study Hours,Sports Involvement,IQ Score
0,Zain Tariq,24,2.61,1.3,Yes,112
1,Fatima Nawaz,21,3.07,2.4,No,126
2,Ahmed Sheikh,22,2.65,5.9,No,97

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                500 non-null    object
 1   Age                 500 non-null    int64
 2   CGPA (out of 4.00)  500 non-null    float64
 3   Daily Study Hours   500 non-null    float64
 4   Sports Involvement  500 non-null    object
 5   IQ Score            500 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 23.6+ KB

In [6]:
data['Age'].value_counts()

Age
21    82
18    81
23    73
24    72
20    71
19    64
22    57
Name: count, dtype: int64

In [7]:
data.loc[(data['Sports Involvement'] == 'Yes'),"Sports Involvement Yess"] = "1"
data.loc[(data['Sports Involvement'] != 'Yes'),"Sports Involvement Yess"] = "0"

In [8]:
data['Sports Involvement Yes']=(data['Sports Involvement']=='Yes')

In [9]:
data

,Name,Age,CGPA (out of 4.00),Daily Study Hours,Sports Involvement,IQ Score,Sports Involvement Yess,Sports Involvement Yes
0,Zain Tariq,24,2.61,1.3,Yes,112,1,True
1,Fatima Nawaz,21,3.07,2.4,No,126,0,False
2,Ahmed Sheikh,22,2.65,5.9,No,97,0,False
3,Zain Qureshi,24,3.66,4.9,Yes,102,1,True
4,Fatima Sheikh,20,2.54,1.3,No,97,0,False
...,...,...,...,...,...,...,...,...
495,Hamza Nawaz,23,2.85,1.1,No,97,0,False
496,Usman Malik,18,2.58,6.7,Yes,126,1,True
497,Fatima Rana,21,3.23,3.2,No,121,0,False
498,Ali Javed,19,3.82,2.9,Yes,137,1,True
499,Usman Qureshi,23,2.28,7.8,No,132,0,False

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Name                     500 non-null    object
 1   Age                      500 non-null    int64
 2   CGPA (out of 4.00)       500 non-null    float64
 3   Daily Study Hours        500 non-null    float64
 4   Sports Involvement       500 non-null    object
 5   IQ Score                 500 non-null    int64
 6   Sports Involvement Yess  500 non-null    object
 7   Sports Involvement Yes   500 non-null    bool
dtypes: bool(1), float64(2), int64(2), object(3)
memory usage: 28.0+ KB

In [11]:
data.replace({'Sports Involvement Yes': 1}, inplace=True)

In [12]:
data['Sports Involvement Yes'].astype('int64')

0      1
1      0
2      0
3      1
4      0
      ..
495    0
496    1
497    0
498    1
499    0
Name: Sports Involvement Yes, Length: 500, dtype: int64

In [13]:
data['Sports Involvement Yes']=data['Sports Involvement Yes'].astype('int64')

In [14]:
data

,Name,Age,CGPA (out of 4.00),Daily Study Hours,Sports Involvement,IQ Score,Sports Involvement Yess,Sports Involvement Yes
0,Zain Tariq,24,2.61,1.3,Yes,112,1,1
1,Fatima Nawaz,21,3.07,2.4,No,126,0,0
2,Ahmed Sheikh,22,2.65,5.9,No,97,0,0
3,Zain Qureshi,24,3.66,4.9,Yes,102,1,1
4,Fatima Sheikh,20,2.54,1.3,No,97,0,0
...,...,...,...,...,...,...,...,...
495,Hamza Nawaz,23,2.85,1.1,No,97,0,0
496,Usman Malik,18,2.58,6.7,Yes,126,1,1
497,Fatima Rana,21,3.23,3.2,No,121,0,0
498,Ali Javed,19,3.82,2.9,Yes,137,1,1
499,Usman Qureshi,23,2.28,7.8,No,132,0,0

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Name                     500 non-null    object
 1   Age                      500 non-null    int64
 2   CGPA (out of 4.00)       500 non-null    float64
 3   Daily Study Hours        500 non-null    float64
 4   Sports Involvement       500 non-null    object
 5   IQ Score                 500 non-null    int64
 6   Sports Involvement Yess  500 non-null    object
 7   Sports Involvement Yes   500 non-null    int64
dtypes: float64(2), int64(3), object(3)
memory usage: 31.4+ KB